README.md
```mermaid
classDiagram
    class Paciente {
        -str __cedula
        -str __nombre
        -int __edad
        -str __telefono
        +get_cedula() str
        +get_nombre() str
        +set_edad(edad) void
        +mostrar_informacion() str
    }

    class Medicamento {
        -str __codigo
        -str __nombre
        -float __precio
        -int __stock
        +aumentar_stock(cantidad) void
        +disminuir_stock(cantidad) void
        +mostrar_informacion() str
    }

    class Medico {
        -str __cedula
        -str __nombre
        -float __salario_base
        -str __especialidad
        +calcular_honorarios_consulta() float
        +mostrar_informacion() str
    }

    class MedicoGeneral {
        -str __consultorio
        +atender_paciente(paciente) str
    }

    class CirujanoEspecialista {
        -str __quirofano
        -float __bono_cirugia
        +realizar_intervencion(paciente) str
    }

    Medico <|-- MedicoGeneral : hereda
    Medico <|-- CirujanoEspecialista : hereda

    class PlanSalud {
        <<abstract>>
        -str __titular
        -str __numero_poliza
        +calcular_cobertura(costo_total)* float
        +calcular_copago(costo_total)* float
        +get_tipo_plan()* str
    }

    class PlanParticular {
        +calcular_cobertura(costo_total) float
        +calcular_copago(costo_total) float
    }

    class PlanSeguroPrivado {
        -float __porcentaje_cobertura
        +calcular_cobertura(costo_total) float
        +calcular_copago(costo_total) float
    }

    class PlanConvenioSeguroPublico {
        -float __deducible_fijo
        +calcular_cobertura(costo_total) float
        +calcular_copago(costo_total) float
    }

    PlanSalud <|-- PlanParticular : implementa
    PlanSalud <|-- PlanSeguroPrivado : implementa
    PlanSalud <|-- PlanConvenioSeguroPublico : implementa

    class Clinica {
        -str __nombre
        -str __direccion
        -List~Medico~ __medicos
        -List~Paciente~ __pacientes
        -List~Medicamento~ __medicamentos
        +registrar_medico(medico) void
        +registrar_paciente(paciente) void
        +agregar_medicamento(medicamento) void
    }

    class ConsultaMedica {
        -str __numero_atencion
        -Paciente __paciente
        -Medico __medico
        -PlanSalud __plan_salud
        -List __medicamentos_recetados
        +prescribir_medicamento(med, cant) void
        +calcular_costo_bruto() float
        +calcular_cobertura_aplicada() float
        +calcular_total_copago() float
        +confirmar_atencion() str
    }

    Clinica *-- Medico : administra
    Clinica *-- Paciente : registra
    Clinica *-- Medicamento : almacena
    ConsultaMedica o-- Paciente : atiende
    ConsultaMedica o-- Medico : atendido por
    ConsultaMedica o-- PlanSalud : liquida polimórficamente
    ConsultaMedica *-- Medicamento : prescribe
```
